asansil/stm32f4xx_drivers/Src/002led_button.c
/*
 * 002led_button.c
 *
 *  Created on: Jun 24, 2025
 *      Author: asans
 */


#include "stm32f407xx.h"

#define HIGH			1
#define BTN_PRESSED		HIGH


void delay(void){
	for(uint32_t i = 0; i < 500000/2; i++);
}


int main(void){

	// Green led
	GPIO_Handle_t GpioGLed;

	GpioGLed.pGPIOx = GPIOD;
	GpioGLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GpioGLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioGLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_VHIGH;
	GpioGLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioGLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	// User button
	GPIO_Handle_t GpioBtn;

	GpioBtn.pGPIOx = GPIOA;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_VHIGH;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;



	GPIO_PeriClockControl(GPIOD, ENABLE);
	GPIO_Init(&GpioGLed);

	GPIO_PeriClockControl(GPIOA, ENABLE);
	GPIO_Init(&GpioBtn);


	//GPIO_WriteToOutputPin(GPIOD, GPIO_PIN_NO_12, ENABLE);
	while(1){
		if(GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0) == BTN_PRESSED){
			GPIO_ToggleOutputPin(GPIOD, GPIO_PIN_NO_12);
			delay();	//to avoid bouncing effect
		}
	}
	return 0;
}
